codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFJ __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFJ0:1;
  unsigned CNFJ1:1;
  unsigned CNFJ2:1;
  unsigned CNFJ3:1;
  unsigned CNFJ4:1;
  unsigned CNFJ5:1;
  unsigned CNFJ6:1;
  unsigned CNFJ7:1;
  unsigned CNFJ8:1;
  unsigned CNFJ9:1;
  unsigned CNFJ10:1;
  unsigned CNFJ11:1;
  unsigned CNFJ12:1;
  unsigned CNFJ13:1;
  unsigned CNFJ14:1;
  unsigned CNFJ15:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISK0:1;
    unsigned TRISK1:1;
    unsigned TRISK2:1;
    unsigned TRISK3:1;
    unsigned TRISK4:1;
    unsigned TRISK5:1;
    unsigned TRISK6:1;
    unsigned TRISK7:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISKbits_t;
extern volatile __TRISKbits_t TRISKbits __asm__ ("TRISK") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RK0:1;
    unsigned RK1:1;
    unsigned RK2:1;
    unsigned RK3:1;
    unsigned RK4:1;
    unsigned RK5:1;
    unsigned RK6:1;
    unsigned RK7:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTKbits_t;
extern volatile __PORTKbits_t PORTKbits __asm__ ("PORTK") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATK0:1;
    unsigned LATK1:1;
    unsigned LATK2:1;
    unsigned LATK3:1;
    unsigned LATK4:1;
    unsigned LATK5:1;
    unsigned LATK6:1;
    unsigned LATK7:1;
  };
  struct {
    unsigned w:32;
  };
} __LATKbits_t;
extern volatile __LATKbits_t LATKbits __asm__ ("LATK") __attribute__((section("sfrs")));
extern volatile unsigned int        LATKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATKSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATKINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCK0:1;
    unsigned ODCK1:1;
    unsigned ODCK2:1;
    unsigned ODCK3:1;
    unsigned ODCK4:1;
    unsigned ODCK5:1;
    unsigned ODCK6:1;
    unsigned ODCK7:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCKbits_t;
extern volatile __ODCKbits_t ODCKbits __asm__ ("ODCK") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUK0:1;
    unsigned CNPUK1:1;
    unsigned CNPUK2:1;
    unsigned CNPUK3:1;
    unsigned CNPUK4:1;
    unsigned CNPUK5:1;
    unsigned CNPUK6:1;
    unsigned CNPUK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUKbits_t;
extern volatile __CNPUKbits_t CNPUKbits __asm__ ("CNPUK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDK0:1;
    unsigned CNPDK1:1;
    unsigned CNPDK2:1;
    unsigned CNPDK3:1;
    unsigned CNPDK4:1;
    unsigned CNPDK5:1;
    unsigned CNPDK6:1;
    unsigned CNPDK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDKbits_t;
extern volatile __CNPDKbits_t CNPDKbits __asm__ ("CNPDK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONKbits_t;
extern volatile __CNCONKbits_t CNCONKbits __asm__ ("CNCONK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEK0:1;
    unsigned CNIEK1:1;
    unsigned CNIEK2:1;
    unsigned CNIEK3:1;
    unsigned CNIEK4:1;
    unsigned CNIEK5:1;
    unsigned CNIEK6:1;
    unsigned CNIEK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENKbits_t;
extern volatile __CNENKbits_t CNENKbits __asm__ ("CNENK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATK0:1;
    unsigned CNSTATK1:1;
    unsigned CNSTATK2:1;
    unsigned CNSTATK3:1;
    unsigned CNSTATK4:1;
    unsigned CNSTATK5:1;
    unsigned CNSTATK6:1;
    unsigned CNSTATK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATKbits_t;
extern volatile __CNSTATKbits_t CNSTATKbits __asm__ ("CNSTATK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNNEK __attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEK0:1;
  unsigned CNNEK1:1;
  unsigned CNNEK2:1;
  unsigned CNNEK3:1;
  unsigned CNNEK4:1;
  unsigned CNNEK5:1;
  unsigned CNNEK6:1;
  unsigned CNNEK7:1;
  unsigned CNNEK8:1;
  unsigned CNNEK9:1;
  unsigned CNNEK10:1;
  unsigned CNNEK11:1;
  unsigned CNNEK12:1;
  unsigned CNNEK13:1;
  unsigned CNNEK14:1;
  unsigned CNNEK15:1;
} __CNNEKbits_t;
extern volatile __CNNEKbits_t CNNEKbits __asm__ ("CNNEK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFK __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFK0:1;
  unsigned CNFK1:1;
  unsigned CNFK2:1;
  unsigned CNFK3:1;
  unsigned CNFK4:1;
  unsigned CNFK5:1;
  unsigned CNFK6:1;
  unsigned CNFK7:1;
  unsigned CNFK8:1;
  unsigned CNFK9:1;
  unsigned CNFK10:1;
  unsigned CNFK11:1;
  unsigned CNFK12:1;
  unsigned CNFK13:1;
  unsigned CNFK14:1;
  unsigned CNFK15:1;
} __CNFKbits_t;
extern volatile __CNFKbits_t CNFKbits __asm__ ("CNFK") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BUFCDEC:1;
    unsigned :3;
    unsigned MANFC:1;
    unsigned :2;
    unsigned AUTOFC:1;
    unsigned RXEN:1;
    unsigned TXRTS:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned PTV:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned RXBUF_SZ:7;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXST __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned TXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHTXSTbits_t;
