codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
#define _IPC51_ADC7EIS_POSITION                  0x00000008
#define _IPC51_ADC7EIS_MASK                      0x00000300
#define _IPC51_ADC7EIS_LENGTH                    0x00000002

#define _IPC51_ADC7EIP_POSITION                  0x0000000A
#define _IPC51_ADC7EIP_MASK                      0x00001C00
#define _IPC51_ADC7EIP_LENGTH                    0x00000003

#define _IPC51_ADC0WIS_POSITION                  0x00000010
#define _IPC51_ADC0WIS_MASK                      0x00030000
#define _IPC51_ADC0WIS_LENGTH                    0x00000002

#define _IPC51_ADC0WIP_POSITION                  0x00000012
#define _IPC51_ADC0WIP_MASK                      0x001C0000
#define _IPC51_ADC0WIP_LENGTH                    0x00000003

#define _IPC51_ADC1WIS_POSITION                  0x00000018
#define _IPC51_ADC1WIS_MASK                      0x03000000
#define _IPC51_ADC1WIS_LENGTH                    0x00000002

#define _IPC51_ADC1WIP_POSITION                  0x0000001A
#define _IPC51_ADC1WIP_MASK                      0x1C000000
#define _IPC51_ADC1WIP_LENGTH                    0x00000003

#define _IPC51_w_POSITION                        0x00000000
#define _IPC51_w_MASK                            0xFFFFFFFF
#define _IPC51_w_LENGTH                          0x00000020

#define _IPC52_ADC2WIS_POSITION                  0x00000000
#define _IPC52_ADC2WIS_MASK                      0x00000003
#define _IPC52_ADC2WIS_LENGTH                    0x00000002

#define _IPC52_ADC2WIP_POSITION                  0x00000002
#define _IPC52_ADC2WIP_MASK                      0x0000001C
#define _IPC52_ADC2WIP_LENGTH                    0x00000003

#define _IPC52_ADC3WIS_POSITION                  0x00000008
#define _IPC52_ADC3WIS_MASK                      0x00000300
#define _IPC52_ADC3WIS_LENGTH                    0x00000002

#define _IPC52_ADC3WIP_POSITION                  0x0000000A
#define _IPC52_ADC3WIP_MASK                      0x00001C00
#define _IPC52_ADC3WIP_LENGTH                    0x00000003

#define _IPC52_ADC4WIS_POSITION                  0x00000010
#define _IPC52_ADC4WIS_MASK                      0x00030000
#define _IPC52_ADC4WIS_LENGTH                    0x00000002

#define _IPC52_ADC4WIP_POSITION                  0x00000012
#define _IPC52_ADC4WIP_MASK                      0x001C0000
#define _IPC52_ADC4WIP_LENGTH                    0x00000003

#define _IPC52_w_POSITION                        0x00000000
#define _IPC52_w_MASK                            0xFFFFFFFF
#define _IPC52_w_LENGTH                          0x00000020

#define _IPC53_ADC7WIS_POSITION                  0x00000008
#define _IPC53_ADC7WIS_MASK                      0x00000300
#define _IPC53_ADC7WIS_LENGTH                    0x00000002

#define _IPC53_ADC7WIP_POSITION                  0x0000000A
#define _IPC53_ADC7WIP_MASK                      0x00001C00
#define _IPC53_ADC7WIP_LENGTH                    0x00000003

#define _IPC53_w_POSITION                        0x00000000
#define _IPC53_w_MASK                            0xFFFFFFFF
#define _IPC53_w_LENGTH                          0x00000020

#define _OFF000_VOFF_POSITION                    0x00000001
#define _OFF000_VOFF_MASK                        0x0003FFFE
#define _OFF000_VOFF_LENGTH                      0x00000011

#define _OFF001_VOFF_POSITION                    0x00000001
#define _OFF001_VOFF_MASK                        0x0003FFFE
#define _OFF001_VOFF_LENGTH                      0x00000011

#define _OFF002_VOFF_POSITION                    0x00000001
#define _OFF002_VOFF_MASK                        0x0003FFFE
#define _OFF002_VOFF_LENGTH                      0x00000011

#define _OFF003_VOFF_POSITION                    0x00000001
#define _OFF003_VOFF_MASK                        0x0003FFFE
#define _OFF003_VOFF_LENGTH                      0x00000011

#define _OFF004_VOFF_POSITION                    0x00000001
#define _OFF004_VOFF_MASK                        0x0003FFFE
#define _OFF004_VOFF_LENGTH                      0x00000011

#define _OFF005_VOFF_POSITION                    0x00000001
#define _OFF005_VOFF_MASK                        0x0003FFFE
#define _OFF005_VOFF_LENGTH                      0x00000011

#define _OFF006_VOFF_POSITION                    0x00000001
#define _OFF006_VOFF_MASK                        0x0003FFFE
#define _OFF006_VOFF_LENGTH                      0x00000011

#define _OFF007_VOFF_POSITION                    0x00000001
#define _OFF007_VOFF_MASK                        0x0003FFFE
#define _OFF007_VOFF_LENGTH                      0x00000011

#define _OFF008_VOFF_POSITION                    0x00000001
#define _OFF008_VOFF_MASK                        0x0003FFFE
#define _OFF008_VOFF_LENGTH                      0x00000011

#define _OFF009_VOFF_POSITION                    0x00000001
#define _OFF009_VOFF_MASK                        0x0003FFFE
#define _OFF009_VOFF_LENGTH                      0x00000011

#define _OFF010_VOFF_POSITION                    0x00000001
#define _OFF010_VOFF_MASK                        0x0003FFFE
#define _OFF010_VOFF_LENGTH                      0x00000011

#define _OFF011_VOFF_POSITION                    0x00000001
#define _OFF011_VOFF_MASK                        0x0003FFFE
#define _OFF011_VOFF_LENGTH                      0x00000011

#define _OFF012_VOFF_POSITION                    0x00000001
#define _OFF012_VOFF_MASK                        0x0003FFFE
#define _OFF012_VOFF_LENGTH                      0x00000011

#define _OFF013_VOFF_POSITION                    0x00000001
#define _OFF013_VOFF_MASK                        0x0003FFFE
#define _OFF013_VOFF_LENGTH                      0x00000011

#define _OFF014_VOFF_POSITION                    0x00000001
#define _OFF014_VOFF_MASK                        0x0003FFFE
#define _OFF014_VOFF_LENGTH                      0x00000011

#define _OFF015_VOFF_POSITION                    0x00000001
#define _OFF015_VOFF_MASK                        0x0003FFFE
#define _OFF015_VOFF_LENGTH                      0x00000011

#define _OFF016_VOFF_POSITION                    0x00000001
#define _OFF016_VOFF_MASK                        0x0003FFFE
#define _OFF016_VOFF_LENGTH                      0x00000011

#define _OFF017_VOFF_POSITION                    0x00000001
#define _OFF017_VOFF_MASK                        0x0003FFFE
#define _OFF017_VOFF_LENGTH                      0x00000011

#define _OFF018_VOFF_POSITION                    0x00000001
#define _OFF018_VOFF_MASK                        0x0003FFFE
#define _OFF018_VOFF_LENGTH                      0x00000011

#define _OFF019_VOFF_POSITION                    0x00000001
#define _OFF019_VOFF_MASK                        0x0003FFFE
#define _OFF019_VOFF_LENGTH                      0x00000011

#define _OFF020_VOFF_POSITION                    0x00000001
#define _OFF020_VOFF_MASK                        0x0003FFFE
#define _OFF020_VOFF_LENGTH                      0x00000011

#define _OFF021_VOFF_POSITION                    0x00000001
#define _OFF021_VOFF_MASK                        0x0003FFFE
#define _OFF021_VOFF_LENGTH                      0x00000011

