codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
#define _OFF134_VOFF_POSITION                    0x00000001
#define _OFF134_VOFF_MASK                        0x0003FFFE
#define _OFF134_VOFF_LENGTH                      0x00000011

#define _OFF135_VOFF_POSITION                    0x00000001
#define _OFF135_VOFF_MASK                        0x0003FFFE
#define _OFF135_VOFF_LENGTH                      0x00000011

#define _OFF136_VOFF_POSITION                    0x00000001
#define _OFF136_VOFF_MASK                        0x0003FFFE
#define _OFF136_VOFF_LENGTH                      0x00000011

#define _OFF137_VOFF_POSITION                    0x00000001
#define _OFF137_VOFF_MASK                        0x0003FFFE
#define _OFF137_VOFF_LENGTH                      0x00000011

#define _OFF138_VOFF_POSITION                    0x00000001
#define _OFF138_VOFF_MASK                        0x0003FFFE
#define _OFF138_VOFF_LENGTH                      0x00000011

#define _OFF139_VOFF_POSITION                    0x00000001
#define _OFF139_VOFF_MASK                        0x0003FFFE
#define _OFF139_VOFF_LENGTH                      0x00000011

#define _OFF140_VOFF_POSITION                    0x00000001
#define _OFF140_VOFF_MASK                        0x0003FFFE
#define _OFF140_VOFF_LENGTH                      0x00000011

#define _OFF141_VOFF_POSITION                    0x00000001
#define _OFF141_VOFF_MASK                        0x0003FFFE
#define _OFF141_VOFF_LENGTH                      0x00000011

#define _OFF142_VOFF_POSITION                    0x00000001
#define _OFF142_VOFF_MASK                        0x0003FFFE
#define _OFF142_VOFF_LENGTH                      0x00000011

#define _OFF143_VOFF_POSITION                    0x00000001
#define _OFF143_VOFF_MASK                        0x0003FFFE
#define _OFF143_VOFF_LENGTH                      0x00000011

#define _OFF144_VOFF_POSITION                    0x00000001
#define _OFF144_VOFF_MASK                        0x0003FFFE
#define _OFF144_VOFF_LENGTH                      0x00000011

#define _OFF145_VOFF_POSITION                    0x00000001
#define _OFF145_VOFF_MASK                        0x0003FFFE
#define _OFF145_VOFF_LENGTH                      0x00000011

#define _OFF146_VOFF_POSITION                    0x00000001
#define _OFF146_VOFF_MASK                        0x0003FFFE
#define _OFF146_VOFF_LENGTH                      0x00000011

#define _OFF147_VOFF_POSITION                    0x00000001
#define _OFF147_VOFF_MASK                        0x0003FFFE
#define _OFF147_VOFF_LENGTH                      0x00000011

#define _OFF148_VOFF_POSITION                    0x00000001
#define _OFF148_VOFF_MASK                        0x0003FFFE
#define _OFF148_VOFF_LENGTH                      0x00000011

#define _OFF149_VOFF_POSITION                    0x00000001
#define _OFF149_VOFF_MASK                        0x0003FFFE
#define _OFF149_VOFF_LENGTH                      0x00000011

#define _OFF150_VOFF_POSITION                    0x00000001
#define _OFF150_VOFF_MASK                        0x0003FFFE
#define _OFF150_VOFF_LENGTH                      0x00000011

#define _OFF153_VOFF_POSITION                    0x00000001
#define _OFF153_VOFF_MASK                        0x0003FFFE
#define _OFF153_VOFF_LENGTH                      0x00000011

#define _OFF154_VOFF_POSITION                    0x00000001
#define _OFF154_VOFF_MASK                        0x0003FFFE
#define _OFF154_VOFF_LENGTH                      0x00000011

#define _OFF155_VOFF_POSITION                    0x00000001
#define _OFF155_VOFF_MASK                        0x0003FFFE
#define _OFF155_VOFF_LENGTH                      0x00000011

#define _OFF156_VOFF_POSITION                    0x00000001
#define _OFF156_VOFF_MASK                        0x0003FFFE
#define _OFF156_VOFF_LENGTH                      0x00000011

#define _OFF157_VOFF_POSITION                    0x00000001
#define _OFF157_VOFF_MASK                        0x0003FFFE
#define _OFF157_VOFF_LENGTH                      0x00000011

#define _OFF158_VOFF_POSITION                    0x00000001
#define _OFF158_VOFF_MASK                        0x0003FFFE
#define _OFF158_VOFF_LENGTH                      0x00000011

#define _OFF159_VOFF_POSITION                    0x00000001
#define _OFF159_VOFF_MASK                        0x0003FFFE
#define _OFF159_VOFF_LENGTH                      0x00000011

#define _OFF160_VOFF_POSITION                    0x00000001
#define _OFF160_VOFF_MASK                        0x0003FFFE
#define _OFF160_VOFF_LENGTH                      0x00000011

#define _OFF161_VOFF_POSITION                    0x00000001
#define _OFF161_VOFF_MASK                        0x0003FFFE
#define _OFF161_VOFF_LENGTH                      0x00000011

#define _OFF162_VOFF_POSITION                    0x00000001
#define _OFF162_VOFF_MASK                        0x0003FFFE
#define _OFF162_VOFF_LENGTH                      0x00000011

#define _OFF163_VOFF_POSITION                    0x00000001
#define _OFF163_VOFF_MASK                        0x0003FFFE
#define _OFF163_VOFF_LENGTH                      0x00000011

#define _OFF164_VOFF_POSITION                    0x00000001
#define _OFF164_VOFF_MASK                        0x0003FFFE
#define _OFF164_VOFF_LENGTH                      0x00000011

#define _OFF165_VOFF_POSITION                    0x00000001
#define _OFF165_VOFF_MASK                        0x0003FFFE
#define _OFF165_VOFF_LENGTH                      0x00000011

#define _OFF166_VOFF_POSITION                    0x00000001
#define _OFF166_VOFF_MASK                        0x0003FFFE
#define _OFF166_VOFF_LENGTH                      0x00000011

#define _OFF167_VOFF_POSITION                    0x00000001
#define _OFF167_VOFF_MASK                        0x0003FFFE
#define _OFF167_VOFF_LENGTH                      0x00000011

#define _OFF168_VOFF_POSITION                    0x00000001
#define _OFF168_VOFF_MASK                        0x0003FFFE
#define _OFF168_VOFF_LENGTH                      0x00000011

#define _OFF169_VOFF_POSITION                    0x00000001
#define _OFF169_VOFF_MASK                        0x0003FFFE
#define _OFF169_VOFF_LENGTH                      0x00000011

#define _OFF170_VOFF_POSITION                    0x00000001
#define _OFF170_VOFF_MASK                        0x0003FFFE
#define _OFF170_VOFF_LENGTH                      0x00000011

#define _OFF171_VOFF_POSITION                    0x00000001
#define _OFF171_VOFF_MASK                        0x0003FFFE
#define _OFF171_VOFF_LENGTH                      0x00000011

#define _OFF172_VOFF_POSITION                    0x00000001
#define _OFF172_VOFF_MASK                        0x0003FFFE
#define _OFF172_VOFF_LENGTH                      0x00000011

#define _OFF173_VOFF_POSITION                    0x00000001
#define _OFF173_VOFF_MASK                        0x0003FFFE
#define _OFF173_VOFF_LENGTH                      0x00000011

#define _OFF174_VOFF_POSITION                    0x00000001
#define _OFF174_VOFF_MASK                        0x0003FFFE
#define _OFF174_VOFF_LENGTH                      0x00000011

#define _OFF175_VOFF_POSITION                    0x00000001
#define _OFF175_VOFF_MASK                        0x0003FFFE
#define _OFF175_VOFF_LENGTH                      0x00000011

