codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
#define _CNFF_CNFF2_POSITION                     0x00000002
#define _CNFF_CNFF2_MASK                         0x00000004
#define _CNFF_CNFF2_LENGTH                       0x00000001

#define _CNFF_CNFF3_POSITION                     0x00000003
#define _CNFF_CNFF3_MASK                         0x00000008
#define _CNFF_CNFF3_LENGTH                       0x00000001

#define _CNFF_CNFF4_POSITION                     0x00000004
#define _CNFF_CNFF4_MASK                         0x00000010
#define _CNFF_CNFF4_LENGTH                       0x00000001

#define _CNFF_CNFF5_POSITION                     0x00000005
#define _CNFF_CNFF5_MASK                         0x00000020
#define _CNFF_CNFF5_LENGTH                       0x00000001

#define _CNFF_CNFF6_POSITION                     0x00000006
#define _CNFF_CNFF6_MASK                         0x00000040
#define _CNFF_CNFF6_LENGTH                       0x00000001

#define _CNFF_CNFF7_POSITION                     0x00000007
#define _CNFF_CNFF7_MASK                         0x00000080
#define _CNFF_CNFF7_LENGTH                       0x00000001

#define _CNFF_CNFF8_POSITION                     0x00000008
#define _CNFF_CNFF8_MASK                         0x00000100
#define _CNFF_CNFF8_LENGTH                       0x00000001

#define _CNFF_CNFF9_POSITION                     0x00000009
#define _CNFF_CNFF9_MASK                         0x00000200
#define _CNFF_CNFF9_LENGTH                       0x00000001

#define _CNFF_CNFF10_POSITION                    0x0000000A
#define _CNFF_CNFF10_MASK                        0x00000400
#define _CNFF_CNFF10_LENGTH                      0x00000001

#define _CNFF_CNFF11_POSITION                    0x0000000B
#define _CNFF_CNFF11_MASK                        0x00000800
#define _CNFF_CNFF11_LENGTH                      0x00000001

#define _CNFF_CNFF12_POSITION                    0x0000000C
#define _CNFF_CNFF12_MASK                        0x00001000
#define _CNFF_CNFF12_LENGTH                      0x00000001

#define _CNFF_CNFF13_POSITION                    0x0000000D
#define _CNFF_CNFF13_MASK                        0x00002000
#define _CNFF_CNFF13_LENGTH                      0x00000001

#define _CNFF_CNFF14_POSITION                    0x0000000E
#define _CNFF_CNFF14_MASK                        0x00004000
#define _CNFF_CNFF14_LENGTH                      0x00000001

#define _CNFF_CNFF15_POSITION                    0x0000000F
#define _CNFF_CNFF15_MASK                        0x00008000
#define _CNFF_CNFF15_LENGTH                      0x00000001

#define _SRCON0F_SR0F0_POSITION                  0x00000000
#define _SRCON0F_SR0F0_MASK                      0x00000001
#define _SRCON0F_SR0F0_LENGTH                    0x00000001

#define _SRCON0F_SR0F1_POSITION                  0x00000001
#define _SRCON0F_SR0F1_MASK                      0x00000002
#define _SRCON0F_SR0F1_LENGTH                    0x00000001

#define _SRCON0F_SR0F2_POSITION                  0x00000002
#define _SRCON0F_SR0F2_MASK                      0x00000004
#define _SRCON0F_SR0F2_LENGTH                    0x00000001

#define _SRCON0F_SR0F3_POSITION                  0x00000003
#define _SRCON0F_SR0F3_MASK                      0x00000008
#define _SRCON0F_SR0F3_LENGTH                    0x00000001

#define _SRCON0F_SR0F4_POSITION                  0x00000004
#define _SRCON0F_SR0F4_MASK                      0x00000010
#define _SRCON0F_SR0F4_LENGTH                    0x00000001

#define _SRCON0F_SR0F5_POSITION                  0x00000005
#define _SRCON0F_SR0F5_MASK                      0x00000020
#define _SRCON0F_SR0F5_LENGTH                    0x00000001

#define _SRCON0F_SR0F6_POSITION                  0x00000006
#define _SRCON0F_SR0F6_MASK                      0x00000040
#define _SRCON0F_SR0F6_LENGTH                    0x00000001

#define _SRCON0F_SR0F7_POSITION                  0x00000007
#define _SRCON0F_SR0F7_MASK                      0x00000080
#define _SRCON0F_SR0F7_LENGTH                    0x00000001

#define _SRCON0F_SR0F8_POSITION                  0x00000008
#define _SRCON0F_SR0F8_MASK                      0x00000100
#define _SRCON0F_SR0F8_LENGTH                    0x00000001

#define _SRCON0F_SR0F9_POSITION                  0x00000009
#define _SRCON0F_SR0F9_MASK                      0x00000200
#define _SRCON0F_SR0F9_LENGTH                    0x00000001

#define _SRCON0F_SR0F10_POSITION                 0x0000000A
#define _SRCON0F_SR0F10_MASK                     0x00000400
#define _SRCON0F_SR0F10_LENGTH                   0x00000001

#define _SRCON0F_SR0F11_POSITION                 0x0000000B
#define _SRCON0F_SR0F11_MASK                     0x00000800
#define _SRCON0F_SR0F11_LENGTH                   0x00000001

#define _SRCON0F_SR0F12_POSITION                 0x0000000C
#define _SRCON0F_SR0F12_MASK                     0x00001000
#define _SRCON0F_SR0F12_LENGTH                   0x00000001

#define _SRCON0F_SR0F13_POSITION                 0x0000000D
#define _SRCON0F_SR0F13_MASK                     0x00002000
#define _SRCON0F_SR0F13_LENGTH                   0x00000001

#define _SRCON0F_SR0F14_POSITION                 0x0000000E
#define _SRCON0F_SR0F14_MASK                     0x00004000
#define _SRCON0F_SR0F14_LENGTH                   0x00000001

#define _SRCON0F_SR0F15_POSITION                 0x0000000F
#define _SRCON0F_SR0F15_MASK                     0x00008000
#define _SRCON0F_SR0F15_LENGTH                   0x00000001

#define _SRCON1F_SR1F0_POSITION                  0x00000000
#define _SRCON1F_SR1F0_MASK                      0x00000001
#define _SRCON1F_SR1F0_LENGTH                    0x00000001

#define _SRCON1F_SR1F1_POSITION                  0x00000001
#define _SRCON1F_SR1F1_MASK                      0x00000002
#define _SRCON1F_SR1F1_LENGTH                    0x00000001

#define _SRCON1F_SR1F2_POSITION                  0x00000002
#define _SRCON1F_SR1F2_MASK                      0x00000004
#define _SRCON1F_SR1F2_LENGTH                    0x00000001

#define _SRCON1F_SR1F3_POSITION                  0x00000003
#define _SRCON1F_SR1F3_MASK                      0x00000008
#define _SRCON1F_SR1F3_LENGTH                    0x00000001

#define _SRCON1F_SR1F4_POSITION                  0x00000004
#define _SRCON1F_SR1F4_MASK                      0x00000010
#define _SRCON1F_SR1F4_LENGTH                    0x00000001

#define _SRCON1F_SR1F5_POSITION                  0x00000005
#define _SRCON1F_SR1F5_MASK                      0x00000020
#define _SRCON1F_SR1F5_LENGTH                    0x00000001

#define _SRCON1F_SR1F6_POSITION                  0x00000006
#define _SRCON1F_SR1F6_MASK                      0x00000040
#define _SRCON1F_SR1F6_LENGTH                    0x00000001

#define _SRCON1F_SR1F7_POSITION                  0x00000007
#define _SRCON1F_SR1F7_MASK                      0x00000080
#define _SRCON1F_SR1F7_LENGTH                    0x00000001

#define _SRCON1F_SR1F8_POSITION                  0x00000008
#define _SRCON1F_SR1F8_MASK                      0x00000100
#define _SRCON1F_SR1F8_LENGTH                    0x00000001

#define _SRCON1F_SR1F9_POSITION                  0x00000009
#define _SRCON1F_SR1F9_MASK                      0x00000200
#define _SRCON1F_SR1F9_LENGTH                    0x00000001

