codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
#define _CNFG_CNFG0_POSITION                     0x00000000
#define _CNFG_CNFG0_MASK                         0x00000001
#define _CNFG_CNFG0_LENGTH                       0x00000001

#define _CNFG_CNFG1_POSITION                     0x00000001
#define _CNFG_CNFG1_MASK                         0x00000002
#define _CNFG_CNFG1_LENGTH                       0x00000001

#define _CNFG_CNFG2_POSITION                     0x00000002
#define _CNFG_CNFG2_MASK                         0x00000004
#define _CNFG_CNFG2_LENGTH                       0x00000001

#define _CNFG_CNFG3_POSITION                     0x00000003
#define _CNFG_CNFG3_MASK                         0x00000008
#define _CNFG_CNFG3_LENGTH                       0x00000001

#define _CNFG_CNFG4_POSITION                     0x00000004
#define _CNFG_CNFG4_MASK                         0x00000010
#define _CNFG_CNFG4_LENGTH                       0x00000001

#define _CNFG_CNFG5_POSITION                     0x00000005
#define _CNFG_CNFG5_MASK                         0x00000020
#define _CNFG_CNFG5_LENGTH                       0x00000001

#define _CNFG_CNFG6_POSITION                     0x00000006
#define _CNFG_CNFG6_MASK                         0x00000040
#define _CNFG_CNFG6_LENGTH                       0x00000001

#define _CNFG_CNFG7_POSITION                     0x00000007
#define _CNFG_CNFG7_MASK                         0x00000080
#define _CNFG_CNFG7_LENGTH                       0x00000001

#define _CNFG_CNFG8_POSITION                     0x00000008
#define _CNFG_CNFG8_MASK                         0x00000100
#define _CNFG_CNFG8_LENGTH                       0x00000001

#define _CNFG_CNFG9_POSITION                     0x00000009
#define _CNFG_CNFG9_MASK                         0x00000200
#define _CNFG_CNFG9_LENGTH                       0x00000001

#define _CNFG_CNFG10_POSITION                    0x0000000A
#define _CNFG_CNFG10_MASK                        0x00000400
#define _CNFG_CNFG10_LENGTH                      0x00000001

#define _CNFG_CNFG11_POSITION                    0x0000000B
#define _CNFG_CNFG11_MASK                        0x00000800
#define _CNFG_CNFG11_LENGTH                      0x00000001

#define _CNFG_CNFG12_POSITION                    0x0000000C
#define _CNFG_CNFG12_MASK                        0x00001000
#define _CNFG_CNFG12_LENGTH                      0x00000001

#define _CNFG_CNFG13_POSITION                    0x0000000D
#define _CNFG_CNFG13_MASK                        0x00002000
#define _CNFG_CNFG13_LENGTH                      0x00000001

#define _CNFG_CNFG14_POSITION                    0x0000000E
#define _CNFG_CNFG14_MASK                        0x00004000
#define _CNFG_CNFG14_LENGTH                      0x00000001

#define _CNFG_CNFG15_POSITION                    0x0000000F
#define _CNFG_CNFG15_MASK                        0x00008000
#define _CNFG_CNFG15_LENGTH                      0x00000001

#define _SRCON0G_SR0G0_POSITION                  0x00000000
#define _SRCON0G_SR0G0_MASK                      0x00000001
#define _SRCON0G_SR0G0_LENGTH                    0x00000001

#define _SRCON0G_SR0G1_POSITION                  0x00000001
#define _SRCON0G_SR0G1_MASK                      0x00000002
#define _SRCON0G_SR0G1_LENGTH                    0x00000001

#define _SRCON0G_SR0G2_POSITION                  0x00000002
#define _SRCON0G_SR0G2_MASK                      0x00000004
#define _SRCON0G_SR0G2_LENGTH                    0x00000001

#define _SRCON0G_SR0G3_POSITION                  0x00000003
#define _SRCON0G_SR0G3_MASK                      0x00000008
#define _SRCON0G_SR0G3_LENGTH                    0x00000001

#define _SRCON0G_SR0G4_POSITION                  0x00000004
#define _SRCON0G_SR0G4_MASK                      0x00000010
#define _SRCON0G_SR0G4_LENGTH                    0x00000001

#define _SRCON0G_SR0G5_POSITION                  0x00000005
#define _SRCON0G_SR0G5_MASK                      0x00000020
#define _SRCON0G_SR0G5_LENGTH                    0x00000001

#define _SRCON0G_SR0G6_POSITION                  0x00000006
#define _SRCON0G_SR0G6_MASK                      0x00000040
#define _SRCON0G_SR0G6_LENGTH                    0x00000001

#define _SRCON0G_SR0G7_POSITION                  0x00000007
#define _SRCON0G_SR0G7_MASK                      0x00000080
#define _SRCON0G_SR0G7_LENGTH                    0x00000001

#define _SRCON0G_SR0G8_POSITION                  0x00000008
#define _SRCON0G_SR0G8_MASK                      0x00000100
#define _SRCON0G_SR0G8_LENGTH                    0x00000001

#define _SRCON0G_SR0G9_POSITION                  0x00000009
#define _SRCON0G_SR0G9_MASK                      0x00000200
#define _SRCON0G_SR0G9_LENGTH                    0x00000001

#define _SRCON0G_SR0G10_POSITION                 0x0000000A
#define _SRCON0G_SR0G10_MASK                     0x00000400
#define _SRCON0G_SR0G10_LENGTH                   0x00000001

#define _SRCON0G_SR0G11_POSITION                 0x0000000B
#define _SRCON0G_SR0G11_MASK                     0x00000800
#define _SRCON0G_SR0G11_LENGTH                   0x00000001

#define _SRCON0G_SR0G12_POSITION                 0x0000000C
#define _SRCON0G_SR0G12_MASK                     0x00001000
#define _SRCON0G_SR0G12_LENGTH                   0x00000001

#define _SRCON0G_SR0G13_POSITION                 0x0000000D
#define _SRCON0G_SR0G13_MASK                     0x00002000
#define _SRCON0G_SR0G13_LENGTH                   0x00000001

#define _SRCON0G_SR0G14_POSITION                 0x0000000E
#define _SRCON0G_SR0G14_MASK                     0x00004000
#define _SRCON0G_SR0G14_LENGTH                   0x00000001

#define _SRCON0G_SR0G15_POSITION                 0x0000000F
#define _SRCON0G_SR0G15_MASK                     0x00008000
#define _SRCON0G_SR0G15_LENGTH                   0x00000001

#define _SRCON1G_SR1G0_POSITION                  0x00000000
#define _SRCON1G_SR1G0_MASK                      0x00000001
#define _SRCON1G_SR1G0_LENGTH                    0x00000001

#define _SRCON1G_SR1G1_POSITION                  0x00000001
#define _SRCON1G_SR1G1_MASK                      0x00000002
#define _SRCON1G_SR1G1_LENGTH                    0x00000001

#define _SRCON1G_SR1G2_POSITION                  0x00000002
#define _SRCON1G_SR1G2_MASK                      0x00000004
#define _SRCON1G_SR1G2_LENGTH                    0x00000001

#define _SRCON1G_SR1G3_POSITION                  0x00000003
#define _SRCON1G_SR1G3_MASK                      0x00000008
#define _SRCON1G_SR1G3_LENGTH                    0x00000001

