codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
#define _TRISK_TRISK7_POSITION                   0x00000007
#define _TRISK_TRISK7_MASK                       0x00000080
#define _TRISK_TRISK7_LENGTH                     0x00000001

#define _TRISK_w_POSITION                        0x00000000
#define _TRISK_w_MASK                            0xFFFFFFFF
#define _TRISK_w_LENGTH                          0x00000020

#define _PORTK_RK0_POSITION                      0x00000000
#define _PORTK_RK0_MASK                          0x00000001
#define _PORTK_RK0_LENGTH                        0x00000001

#define _PORTK_RK1_POSITION                      0x00000001
#define _PORTK_RK1_MASK                          0x00000002
#define _PORTK_RK1_LENGTH                        0x00000001

#define _PORTK_RK2_POSITION                      0x00000002
#define _PORTK_RK2_MASK                          0x00000004
#define _PORTK_RK2_LENGTH                        0x00000001

#define _PORTK_RK3_POSITION                      0x00000003
#define _PORTK_RK3_MASK                          0x00000008
#define _PORTK_RK3_LENGTH                        0x00000001

#define _PORTK_RK4_POSITION                      0x00000004
#define _PORTK_RK4_MASK                          0x00000010
#define _PORTK_RK4_LENGTH                        0x00000001

#define _PORTK_RK5_POSITION                      0x00000005
#define _PORTK_RK5_MASK                          0x00000020
#define _PORTK_RK5_LENGTH                        0x00000001

#define _PORTK_RK6_POSITION                      0x00000006
#define _PORTK_RK6_MASK                          0x00000040
#define _PORTK_RK6_LENGTH                        0x00000001

#define _PORTK_RK7_POSITION                      0x00000007
#define _PORTK_RK7_MASK                          0x00000080
#define _PORTK_RK7_LENGTH                        0x00000001

#define _PORTK_w_POSITION                        0x00000000
#define _PORTK_w_MASK                            0xFFFFFFFF
#define _PORTK_w_LENGTH                          0x00000020

#define _LATK_LATK0_POSITION                     0x00000000
#define _LATK_LATK0_MASK                         0x00000001
#define _LATK_LATK0_LENGTH                       0x00000001

#define _LATK_LATK1_POSITION                     0x00000001
#define _LATK_LATK1_MASK                         0x00000002
#define _LATK_LATK1_LENGTH                       0x00000001

#define _LATK_LATK2_POSITION                     0x00000002
#define _LATK_LATK2_MASK                         0x00000004
#define _LATK_LATK2_LENGTH                       0x00000001

#define _LATK_LATK3_POSITION                     0x00000003
#define _LATK_LATK3_MASK                         0x00000008
#define _LATK_LATK3_LENGTH                       0x00000001

#define _LATK_LATK4_POSITION                     0x00000004
#define _LATK_LATK4_MASK                         0x00000010
#define _LATK_LATK4_LENGTH                       0x00000001

#define _LATK_LATK5_POSITION                     0x00000005
#define _LATK_LATK5_MASK                         0x00000020
#define _LATK_LATK5_LENGTH                       0x00000001

#define _LATK_LATK6_POSITION                     0x00000006
#define _LATK_LATK6_MASK                         0x00000040
#define _LATK_LATK6_LENGTH                       0x00000001

#define _LATK_LATK7_POSITION                     0x00000007
#define _LATK_LATK7_MASK                         0x00000080
#define _LATK_LATK7_LENGTH                       0x00000001

#define _LATK_w_POSITION                         0x00000000
#define _LATK_w_MASK                             0xFFFFFFFF
#define _LATK_w_LENGTH                           0x00000020

#define _ODCK_ODCK0_POSITION                     0x00000000
#define _ODCK_ODCK0_MASK                         0x00000001
#define _ODCK_ODCK0_LENGTH                       0x00000001

#define _ODCK_ODCK1_POSITION                     0x00000001
#define _ODCK_ODCK1_MASK                         0x00000002
#define _ODCK_ODCK1_LENGTH                       0x00000001

#define _ODCK_ODCK2_POSITION                     0x00000002
#define _ODCK_ODCK2_MASK                         0x00000004
#define _ODCK_ODCK2_LENGTH                       0x00000001

#define _ODCK_ODCK3_POSITION                     0x00000003
#define _ODCK_ODCK3_MASK                         0x00000008
#define _ODCK_ODCK3_LENGTH                       0x00000001

#define _ODCK_ODCK4_POSITION                     0x00000004
#define _ODCK_ODCK4_MASK                         0x00000010
#define _ODCK_ODCK4_LENGTH                       0x00000001

#define _ODCK_ODCK5_POSITION                     0x00000005
#define _ODCK_ODCK5_MASK                         0x00000020
#define _ODCK_ODCK5_LENGTH                       0x00000001

#define _ODCK_ODCK6_POSITION                     0x00000006
#define _ODCK_ODCK6_MASK                         0x00000040
#define _ODCK_ODCK6_LENGTH                       0x00000001

#define _ODCK_ODCK7_POSITION                     0x00000007
#define _ODCK_ODCK7_MASK                         0x00000080
#define _ODCK_ODCK7_LENGTH                       0x00000001

#define _ODCK_w_POSITION                         0x00000000
#define _ODCK_w_MASK                             0xFFFFFFFF
#define _ODCK_w_LENGTH                           0x00000020

#define _CNPUK_CNPUK0_POSITION                   0x00000000
#define _CNPUK_CNPUK0_MASK                       0x00000001
#define _CNPUK_CNPUK0_LENGTH                     0x00000001

#define _CNPUK_CNPUK1_POSITION                   0x00000001
#define _CNPUK_CNPUK1_MASK                       0x00000002
#define _CNPUK_CNPUK1_LENGTH                     0x00000001

#define _CNPUK_CNPUK2_POSITION                   0x00000002
#define _CNPUK_CNPUK2_MASK                       0x00000004
#define _CNPUK_CNPUK2_LENGTH                     0x00000001

#define _CNPUK_CNPUK3_POSITION                   0x00000003
#define _CNPUK_CNPUK3_MASK                       0x00000008
#define _CNPUK_CNPUK3_LENGTH                     0x00000001

#define _CNPUK_CNPUK4_POSITION                   0x00000004
#define _CNPUK_CNPUK4_MASK                       0x00000010
#define _CNPUK_CNPUK4_LENGTH                     0x00000001

#define _CNPUK_CNPUK5_POSITION                   0x00000005
#define _CNPUK_CNPUK5_MASK                       0x00000020
#define _CNPUK_CNPUK5_LENGTH                     0x00000001

