codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe144.h
#define _CNPUK_CNPUK6_POSITION                   0x00000006
#define _CNPUK_CNPUK6_MASK                       0x00000040
#define _CNPUK_CNPUK6_LENGTH                     0x00000001

#define _CNPUK_CNPUK7_POSITION                   0x00000007
#define _CNPUK_CNPUK7_MASK                       0x00000080
#define _CNPUK_CNPUK7_LENGTH                     0x00000001

#define _CNPUK_w_POSITION                        0x00000000
#define _CNPUK_w_MASK                            0xFFFFFFFF
#define _CNPUK_w_LENGTH                          0x00000020

#define _CNPDK_CNPDK0_POSITION                   0x00000000
#define _CNPDK_CNPDK0_MASK                       0x00000001
#define _CNPDK_CNPDK0_LENGTH                     0x00000001

#define _CNPDK_CNPDK1_POSITION                   0x00000001
#define _CNPDK_CNPDK1_MASK                       0x00000002
#define _CNPDK_CNPDK1_LENGTH                     0x00000001

#define _CNPDK_CNPDK2_POSITION                   0x00000002
#define _CNPDK_CNPDK2_MASK                       0x00000004
#define _CNPDK_CNPDK2_LENGTH                     0x00000001

#define _CNPDK_CNPDK3_POSITION                   0x00000003
#define _CNPDK_CNPDK3_MASK                       0x00000008
#define _CNPDK_CNPDK3_LENGTH                     0x00000001

#define _CNPDK_CNPDK4_POSITION                   0x00000004
#define _CNPDK_CNPDK4_MASK                       0x00000010
#define _CNPDK_CNPDK4_LENGTH                     0x00000001

#define _CNPDK_CNPDK5_POSITION                   0x00000005
#define _CNPDK_CNPDK5_MASK                       0x00000020
#define _CNPDK_CNPDK5_LENGTH                     0x00000001

#define _CNPDK_CNPDK6_POSITION                   0x00000006
#define _CNPDK_CNPDK6_MASK                       0x00000040
#define _CNPDK_CNPDK6_LENGTH                     0x00000001

#define _CNPDK_CNPDK7_POSITION                   0x00000007
#define _CNPDK_CNPDK7_MASK                       0x00000080
#define _CNPDK_CNPDK7_LENGTH                     0x00000001

#define _CNPDK_w_POSITION                        0x00000000
#define _CNPDK_w_MASK                            0xFFFFFFFF
#define _CNPDK_w_LENGTH                          0x00000020

#define _CNCONK_EDGEDETECT_POSITION              0x0000000B
#define _CNCONK_EDGEDETECT_MASK                  0x00000800
#define _CNCONK_EDGEDETECT_LENGTH                0x00000001

#define _CNCONK_SIDL_POSITION                    0x0000000D
#define _CNCONK_SIDL_MASK                        0x00002000
#define _CNCONK_SIDL_LENGTH                      0x00000001

#define _CNCONK_ON_POSITION                      0x0000000F
#define _CNCONK_ON_MASK                          0x00008000
#define _CNCONK_ON_LENGTH                        0x00000001

#define _CNCONK_w_POSITION                       0x00000000
#define _CNCONK_w_MASK                           0xFFFFFFFF
#define _CNCONK_w_LENGTH                         0x00000020

#define _CNENK_CNIEK0_POSITION                   0x00000000
#define _CNENK_CNIEK0_MASK                       0x00000001
#define _CNENK_CNIEK0_LENGTH                     0x00000001

#define _CNENK_CNIEK1_POSITION                   0x00000001
#define _CNENK_CNIEK1_MASK                       0x00000002
#define _CNENK_CNIEK1_LENGTH                     0x00000001

#define _CNENK_CNIEK2_POSITION                   0x00000002
#define _CNENK_CNIEK2_MASK                       0x00000004
#define _CNENK_CNIEK2_LENGTH                     0x00000001

#define _CNENK_CNIEK3_POSITION                   0x00000003
#define _CNENK_CNIEK3_MASK                       0x00000008
#define _CNENK_CNIEK3_LENGTH                     0x00000001

#define _CNENK_CNIEK4_POSITION                   0x00000004
#define _CNENK_CNIEK4_MASK                       0x00000010
#define _CNENK_CNIEK4_LENGTH                     0x00000001

#define _CNENK_CNIEK5_POSITION                   0x00000005
#define _CNENK_CNIEK5_MASK                       0x00000020
#define _CNENK_CNIEK5_LENGTH                     0x00000001

#define _CNENK_CNIEK6_POSITION                   0x00000006
#define _CNENK_CNIEK6_MASK                       0x00000040
#define _CNENK_CNIEK6_LENGTH                     0x00000001

#define _CNENK_CNIEK7_POSITION                   0x00000007
#define _CNENK_CNIEK7_MASK                       0x00000080
#define _CNENK_CNIEK7_LENGTH                     0x00000001

#define _CNENK_w_POSITION                        0x00000000
#define _CNENK_w_MASK                            0xFFFFFFFF
#define _CNENK_w_LENGTH                          0x00000020

#define _CNSTATK_CNSTATK0_POSITION               0x00000000
#define _CNSTATK_CNSTATK0_MASK                   0x00000001
#define _CNSTATK_CNSTATK0_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK1_POSITION               0x00000001
#define _CNSTATK_CNSTATK1_MASK                   0x00000002
#define _CNSTATK_CNSTATK1_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK2_POSITION               0x00000002
#define _CNSTATK_CNSTATK2_MASK                   0x00000004
#define _CNSTATK_CNSTATK2_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK3_POSITION               0x00000003
#define _CNSTATK_CNSTATK3_MASK                   0x00000008
#define _CNSTATK_CNSTATK3_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK4_POSITION               0x00000004
#define _CNSTATK_CNSTATK4_MASK                   0x00000010
#define _CNSTATK_CNSTATK4_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK5_POSITION               0x00000005
#define _CNSTATK_CNSTATK5_MASK                   0x00000020
#define _CNSTATK_CNSTATK5_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK6_POSITION               0x00000006
#define _CNSTATK_CNSTATK6_MASK                   0x00000040
#define _CNSTATK_CNSTATK6_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK7_POSITION               0x00000007
#define _CNSTATK_CNSTATK7_MASK                   0x00000080
#define _CNSTATK_CNSTATK7_LENGTH                 0x00000001

#define _CNSTATK_w_POSITION                      0x00000000
#define _CNSTATK_w_MASK                          0xFFFFFFFF
#define _CNSTATK_w_LENGTH                        0x00000020

#define _CNNEK_CNNEK0_POSITION                   0x00000000
#define _CNNEK_CNNEK0_MASK                       0x00000001
#define _CNNEK_CNNEK0_LENGTH                     0x00000001

